# Visit https://github.com/Homebrew/homebrew-bundle for more info

#################
# Brew
#################

brew "mas"
# enables 'brew cu' command for easy/interactive casks updates
tap "buo/cask-upgrade"


#################
# Core apps
#################

cask "alfred"
cask "rectangle"
cask "mos"
cash "sensible-side-buttons" # enable mouse side buttons in Mac apps: Finder, Safari, etc
mas "Hidden Bar", id:1452453066

cask "google-chrome"
# cask "firefox"
# cask "tunnelblick" # Open-source OpenVPN-only client
cask "openvpn-connect" # Official OpenVPN Client
# mas "Passepartout, VPN Client", id: 1433648537 # Open-source OpenVpn + Wireguard client
cask "keepassxc"
cask "ticktick"
# cask "dynalist"
cask "standard-notes"
mas "Telegram", id: 747648890
# mas "WhatsApp Desktop", id: 1147396723
mas "Trello", id: 1278508951

# also allow JB ToolBox to generate shell scipts in '/usr/local/bin'
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "obsidian"

mas "OneDrive", id: 823766827
mas "Microsoft Remote Desktop", id: 1295203466
# cask "citrix-workspace"


#################
# Terminal
#################

# brew "zinit" # Consider uncommenting when available https://github.com/zdharma/zinit/issues/225
cask "alacritty"
brew "tmux"
brew "reattach-to-user-namespace" # required by 'tmux-yank' plugin
tap "homebrew/cask-fonts"
cask "font-meslo-lg-nerd-font"


#################
# cli-tools
#################

brew "htop"
brew "unzip"
brew "wget"
brew "watch"

brew "git-lfs"
# Additional manual step: `git lfs install` or `git lfs install --system`

brew "trash"
brew "tree"
# brew "bat"
brew "exa"
# brew "jq"
# brew "yq"
brew "fd"
brew "ripgrep"
brew "zoxide"
brew "fzf"
brew "tldr"
brew "ncdu"
brew "neofetch"
brew "archey4"


#################
# Dev Tools
#################

# required to start using asdf nodejs plugin https://github.com/asdf-vm/asdf-nodejs
brew "coreutils"
brew "gnupg"

tap "bell-sw/liberica"
cask "liberica-jdk17-full"

cask "mongodb-compass"

brew "git-sizer"

# brew "go"
# brew "rust"

# Subversion is no longer included with xcode tools
# brew "svn"

# See https://github.com/chef/homebrew-chef for more
# cask "chef/chef/chefdk"

# brew "InstantClientTap/instantclient/instantclient-basic" # not using 'basiclite', because sqlplus requires non-lite client
# brew "InstantClientTap/instantclient/instantclient-sdk"
# brew "InstantClientTap/instantclient/instantclient-sqlplus"


#################
# Communications
#################

mas "Slack", id: 803453959
cask "skype"
cask "discord"
# cask "microsoft-teams"
cask "zoom"
mas "MeetingBar", id: 1532419400


#################
# Other
#################

cask "docker"
brew "ctop"
brew "dive"
# cask "kitematic"

# brew "kind"
brew "k9s"
brew "stern"
brew "azure-cli"
brew "kubelogin"

brew "earthly"

# cask "virtualbox"

cask "grandperspective"
# cask "insomnia"

# brew "asciinema"
cask "licecap"


brew "ffmpeg"
brew "yt-dlp"
# cask "kap"
# cask "keycastr"
# cask "mkvtoolnix"

cask "android-file-transfer"
cask "deezer"
cask "mpv"
# cask "qbittorrent"

mas "Vimari", id: 1480933944

cask "coconutbattery"
cask "hot"
mas "RunCat", id: 1429033973
# mas "Disk Speed Test", id: 425264550
