# Visit https://github.com/Homebrew/homebrew-bundle for more info

tap "homebrew/core"
tap "homebrew/bundle"

tap "homebrew/cask"
tap "homebrew/cask-versions"
# enables 'brew cu' command for easy casks update
tap "buo/cask-upgrade"

tap "bell-sw/liberica"
cask "bell-sw/liberica/liberica-jdk11"

brew "go"
brew "rust"

brew "svn" # No longer included with xcode tools

brew "coreutils"
brew "gnupg"
brew "htop"
brew "tmux"
brew "unzip"
brew "mas"
brew "wget"
brew "jq"
brew "watch"
brew "reattach-to-user-namespace" # required by 'tmux-yank' plugin

cask "alfred"

brew "trash"
brew "tree"
brew "bat"
brew "exa"
brew "ripgrep"
brew "z"
brew "fd"
brew "fzf"
brew "ncdu"
brew "archey" # see also 'screenfetch'


brew "InstantClientTap/instantclient/instantclient-basic" # not using 'basiclite', because sqlplus requires non-lite client
brew "InstantClientTap/instantclient/instantclient-sdk"
# brew "InstantClientTap/instantclient/instantclient-sqlplus"

# brew "zinit" # TODO: Uncomment when available https://github.com/zdharma/zinit/issues/225
cask "alacritty"
brew "asdf"
brew "gpg" # required to start using asdf nodejs plugin

tap "homebrew/cask-fonts"
cask "font-meslo-lg-nerd-font"

cask "docker"
brew "ctop"
cask "kitematic"

cask "virtualbox"

cask "google-chrome"
cask "grandperspective"
cask "tunnelblick" # You can also use: https://openvpn.net/client-connect-vpn-for-mac-os/


# also allow JB ToolBox to generate shell scipts in '/usr/local/bin'
cask "jetbrains-toolbox"
cask "sublime-text"
cask "obsidian"
cask "visual-studio-code"
cask "insomnia"

brew "asciinema"
cask "licecap"

brew "ffmpeg"
brew "youtube-dl"
cask "mkvtoolnix"

cask "deezer"
cask "mpv"
cask "qbittorrent"

cask "keepassxc"

cask "skype"
cask "discord"

cask "microsoft-teams"
cask "skype-for-business"

# See https://github.com/chef/homebrew-chef for more
cask "chef/chef/chefdk"

cask "coconutbattery"
mas "Disk Speed Test", id: 425264550


mas "Telegram", id: 747648890
mas "Trello", id: 1278508951
mas "Slack", id: 803453959
mas "Microsoft Remote Desktop", id: 1295203466
mas "OneDrive", id: 823766827
mas "Magnet", id: 441258766



# Citrix workspace can't be installed with brew, see:
# https://github.com/Homebrew/homebrew-cask/pull/56881
# Download manually from: https://www.citrix.com/downloads/workspace-app/
