# Visit https://github.com/Homebrew/homebrew-bundle for more info

#################
# Brew
#################

brew "mas"
# enables 'brew cu' command for easy/interactive casks updates
tap "buo/cask-upgrade"


#################
# Core apps
#################

cask "alfred"
cask "rectangle"
cask "mos"
# cash "sensible-side-buttons" # enable mouse side buttons in Mac apps: Finder, Safari, etc
mas "Hidden Bar", id:1452453066

cask "google-chrome"
cask "firefox"
# cask "tunnelblick" # Open-source OpenVPN-only client
# cask "openvpn-connect" # Official OpenVPN Client
mas "Passepartout, VPN Client", id: 1433648537 # Open-source OpenVpn + Wireguard client
# mas "Outline-Secure internet access", id: 1356178125
# mas "Tailscale", id: 1475387142
cask "keepassxc"
mas "TickTick:To-Do List, Calendar", id: 966085870
# cask "dynalist"
cask "standard-notes"
mas "Telegram", id: 747648890
# mas "WhatsApp Desktop", id: 1147396723
# mas "Trello", id: 1278508951

# also allow JB ToolBox to generate shell scipts in '/usr/local/bin'
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "obsidian"

mas "OneDrive", id: 823766827
# mas "Microsoft Remote Desktop", id: 1295203466
# cask "citrix-workspace"


#################
# Terminal
#################

cask "alacritty"
brew "tmux"
brew "reattach-to-user-namespace" # required by 'tmux-yank' plugin
tap "homebrew/cask-fonts"
cask "font-meslo-lg-nerd-font"


#################
# cli-tools
#################

brew "htop"
brew "unzip"
brew "wget"
brew "watch"

brew "git-lfs"
brew "diff-so-fancy"
# Additional manual step: `git lfs install` or `git lfs install --system`

brew "trash"
brew "tree"
brew "bat"
brew "eza"
# brew "jq"
# brew "yq"
brew "fd"
brew "ripgrep"
brew "zoxide"
brew "fzf"
# do not forget to execute: $(brew --prefix)/opt/fzf/install
brew "tldr"
brew "ncdu"
# brew "neofetch"
# brew "archey4"


#################
# Dev Tools
#################

# tap "bell-sw/liberica"
# cask "liberica-jdk17-full"

# cask "mongodb-compass"

brew "git-sizer"

brew "shellcheck"
brew "shfmt"

# brew "go"
# brew "rust"

# Subversion is no longer included with xcode tools
# brew "svn"

# See https://github.com/chef/homebrew-chef for more
# cask "chef/chef/chefdk"

# brew "InstantClientTap/instantclient/instantclient-basic" # not using 'basiclite', because sqlplus requires non-lite client
# brew "InstantClientTap/instantclient/instantclient-sdk"
# brew "InstantClientTap/instantclient/instantclient-sqlplus"

#################
# Docker tools
#################

cask "docker"
# cask "rancher"
# brew "earthly"
brew "ctop"
brew "dive"


#################
# Kubernetes tools
#################

# brew "kind"
# brew "k9s"
# brew "stern"


#################
# Azure tools
#################
# brew "azure-cli"
# brew "Azure/kubelogin/kubelogin"


#################
# Communications
#################

# mas "Slack", id: 803453959
# cask "skype"
# cask "discord"
# cask "microsoft-teams"
cask "zoom"
mas "MeetingBar", id: 1532419400


#################
# Other
#################

cask "utm"
# cask "virtualbox"

cask "grandperspective"
# cask "insomnia"

# brew "asciinema"
cask "licecap"


brew "ffmpeg"
brew "yt-dlp"
# cask "kap"
# cask "keycastr"
# cask "mkvtoolnix"

cask "android-file-transfer"
cask "deezer"
cask "iina"
# cask "qbittorrent"

mas "Vimari", id: 1480933944

cask "coconutbattery"
# cask "hot"
cask "sloth"
mas "RunCat", id: 1429033973
# mas "Disk Speed Test", id: 425264550
